# Automate deployment, configuration, and upgrading
brew "ansible"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Fully functional local AWS cloud stack
brew "localstack"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Terminal multiplexer
brew "tmux"
# Tools for building Android applications
cask "android-studio"
# Web browser focusing on privacy
cask "brave-browser"
# Write, edit, and chat about your code with AI
cask "cursor"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie"
# HTTP and GraphQL Client
cask "insomnia"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Discover, download, and run local LLMs
cask "lm-studio"
# Clipboard manager
cask "maccy"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Open-source software for live streaming and screen recording
cask "obs"
# Get up and running with large language models locally
cask "ollama"
# Open source virtual/remote desktop application
cask "rustdesk"
# Dictation tool including LLM reformatting
cask "superwhisper"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Multimedia player
cask "vlc"
# Gecko based web browser
cask "zen"
vscode "vscodevim.vim"
